IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCAN0_SS.xml
<module name="MCAN0_SS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MMR__MMRVBP__MCANSS_REGS_MCANSS_PID" acronym="MMR__MMRVBP__MCANSS_REGS_MCANSS_PID" offset="0x0" width="32" description="The Revision Register contains the major and minor revisions for the module.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID register scheme" range="31 - 30" rwaccess="R"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="Business Unit: 10 = Processors" range="29 - 28" rwaccess="R"/> 
		<bitfield id="MODULE_ID" width="12" begin="27" end="16" resetval="0x2272" description="Module ID" range="27 - 16" rwaccess="R"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x10" description="RTL revision. Will vary depending on release." range="15 - 11" rwaccess="R"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x1" description="Major revision" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7 - 6" rwaccess="R"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x1" description="Minor revision" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="MMR__MMRVBP__MCANSS_REGS_MCANSS_CTRL" acronym="MMR__MMRVBP__MCANSS_REGS_MCANSS_CTRL" offset="0x4" width="32" description="The Control Register contains general control bits for the MCANSS">
		<bitfield id="EXT_TS_CNTR_EN" width="1" begin="6" end="6" resetval="0x0" description="External TimeStamp Counter Enable" range="6" rwaccess="R/W"/> 
		<bitfield id="AUTOWAKEUP" width="1" begin="5" end="5" resetval="0x0" description="Automatic Wakeup Enable" range="5" rwaccess="R/W"/> 
		<bitfield id="WAKEUPREQEN" width="1" begin="4" end="4" resetval="0x0" description="Wakeup Request Enable" range="4" rwaccess="R/W"/> 
		<bitfield id="DBGSUSP_FREE" width="1" begin="3" end="3" resetval="0x1" description="0-Honor Debug Suspend, 1-Disregard debug suspend" range="3" rwaccess="R/W"/>
	</register>
	<register id="MMR__MMRVBP__MCANSS_REGS_MCANSS_STAT" acronym="MMR__MMRVBP__MCANSS_REGS_MCANSS_STAT" offset="0x8" width="32" description="The Status register provide general status bits for the MCANSS">
		<bitfield id="ENABLE_FDOE" width="1" begin="2" end="2" resetval="0x0" description="Reflects the value of mcanss_enable_fdoe configuration port x=mcanss_enable_fdoe" range="2" rwaccess="R"/> 
		<bitfield id="MEM_INIT_DONE" width="1" begin="1" end="1" resetval="0x0" description="0:Memory Initialization is in progress, 1:Memory Intialization Done" range="1" rwaccess="R"/>
	</register>
	<register id="MMR__MMRVBP__MCANSS_REGS_MCANSS_ICS" acronym="MMR__MMRVBP__MCANSS_REGS_MCANSS_ICS" offset="0xC" width="32" description="Write to clear interrupt bits">
		<bitfield id="EXT_TS_CNTR_OVFL" width="1" begin="0" end="0" resetval="0x0" description="External TimeStamp Counter Overflow Interrupt status. Write '1' to clear bits." range="0" rwaccess="W"/>
	</register>
	<register id="MMR__MMRVBP__MCANSS_REGS_MCANSS_IRS" acronym="MMR__MMRVBP__MCANSS_REGS_MCANSS_IRS" offset="0x10" width="32" description="Read raw interrupt status. Write '1' to set interrupt bits.">
		<bitfield id="EXT_TS_CNTR_OVFL" width="1" begin="0" end="0" resetval="0x0" description="External TimeStamp Counter Overflow Interrupt status." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="MMR__MMRVBP__MCANSS_REGS_MCANSS_IECS" acronym="MMR__MMRVBP__MCANSS_REGS_MCANSS_IECS" offset="0x14" width="32" description="Write to clear interrupt enable bits">
		<bitfield id="EXT_TS_CNTR_OVFL" width="1" begin="0" end="0" resetval="0x0" description="External TimeStamp Counter Overflow Interrupt. Write '1' to clear bits." range="0" rwaccess="W1TC"/>
	</register>
	<register id="MMR__MMRVBP__MCANSS_REGS_MCANSS_IE" acronym="MMR__MMRVBP__MCANSS_REGS_MCANSS_IE" offset="0x18" width="32" description="Read interrupt Enable">
		<bitfield id="EXT_TS_CNTR_OVFL" width="1" begin="0" end="0" resetval="0x0" description="External TimeStamp Counter Overflow Interrupt." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="MMR__MMRVBP__MCANSS_REGS_MCANSS_IES" acronym="MMR__MMRVBP__MCANSS_REGS_MCANSS_IES" offset="0x1C" width="32" description="Read Enabled Interrupts">
		<bitfield id="EXT_TS_CNTR_OVFL" width="1" begin="0" end="0" resetval="0x0" description="External TimeStamp Counter Overflow Interrupt" range="0" rwaccess="R"/>
	</register>
	<register id="MMR__MMRVBP__MCANSS_REGS_MCANSS_EOI" acronym="MMR__MMRVBP__MCANSS_REGS_MCANSS_EOI" offset="0x20" width="32" description="End of Interrupt Register">
		<bitfield id="EOI" width="8" begin="7" end="0" resetval="0x0" description="Write with bit position of targeted interrupt. (E.g. Ext TS is bit 0). Upon write, level interrupt will clear and if unserviced interrupt counter > 1 will issue another pulse interrupt" range="7 - 0" rwaccess="W"/>
	</register>
	<register id="MMR__MMRVBP__MCANSS_REGS_MCANSS_EXT_TS_PRESCALER" acronym="MMR__MMRVBP__MCANSS_REGS_MCANSS_EXT_TS_PRESCALER" offset="0x24" width="32" description="External TImeStamp PreScaler">
		<bitfield id="PRESCALER" width="24" begin="23" end="0" resetval="0x0" description="External Timestamp Prescaler reload value. External Timestamp count rate is host clock rate divided by this value with one exception: a value of 0 has the same effect as 1" range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="MMR__MMRVBP__MCANSS_REGS_MCANSS_EXT_TS_UNSERVICED_INTR_CNTR" acronym="MMR__MMRVBP__MCANSS_REGS_MCANSS_EXT_TS_UNSERVICED_INTR_CNTR" offset="0x28" width="32" description="External TImeStamp Unserviced Interrupts Counter">
		<bitfield id="EXT_TS_INTR_CNTR" width="5" begin="4" end="0" resetval="0x0" description="Number of unserviced rollover interrupts. If >1 an EOI write will issue another pulse interrupt" range="4 - 0" rwaccess="R"/>
	</register>
</module>